package com.sinapps.task03;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    3. Определить класс Квадратное уравнение. Реализовать методы для поиска корней,
    экстремумов, а также интервалов убывания/возрастания. Создать массив/список/множество
    объектов и определить наибольшие и наименьшие по значению корни.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
