package com.sinapps.task06;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    6. Определить класс Точка на плоскости (в пространстве) и во времени. Задать
    движение точки в определенном направлении. Создать методы по определению
    скорости и ускорения точки. Проверить для двух точек возможность пересечения
    траекторий. Определить расстояние между двумя точками в заданный момент времени.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
