package com.sinapps.task07;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    7. Определить класс Треугольник на плоскости. Определить площадь и периметр
    треугольника. Создать массив/список/множество объектов и подсчитать количество
    треугольников разного типа (равносторонний, равнобедренный, прямоугольный,
    произвольный). Определить для каждой группы наибольший и наименьший по площади
    (периметру) объект.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
