package com.sinapps.task09;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    9. Определить класс Окружность на плоскости. Определить площадь и периметр.
    Создать массив/список/множество объектов и определить группы окружностей,
    центры которых лежат на одной прямой. Определить наибольший и наименьший по
    площади (периметру) объект.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
