package com.sinapps.task08;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    8. Определить класс Четырехугольник на плоскости. Определить площадь и периметр
    четырехугольника. Создать массив/список/множество объектов и подсчитать количество ч
    етырехугольников разного типа (квадрат, прямоугольник, ромб, произвольный).
    Определить для каждой группы наибольший и наименьший по площади (периметру) объект.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
