package com.sinapps.task11;
/*
    Задания к главе 3
    Вариант A

    Создать классы, спецификации которых приведены ниже. Определить конструкторы и методы
    setТип(), getТип(), toString(). Определить дополнительно методы в классе, создающем
    массив объектов. Задать критерий выбора данных и вывести эти данные на консоль. В
    каждом классе, обладающем информацией, должно быть объявлено несколько конструкторов.

    11. Bus: Фамилия и инициалы водителя, Номер автобуса, Номер маршрута, Марка, Год начала эксплуатации, Пробег.
    Создать массив объектов. Вывести:
	    a) список автобусов для заданного номера маршрута;
	    b) список автобусов, которые эксплуатируются больше заданного срока;
	    c) список автобусов, пробег у которых больше заданного расстояния.
 */

public class Main {
    public static void main(String[] args) {

    }
}
