package com.sinapps.task01;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    1. Определить класс Дробь (Рациональная Дробь) в виде пары чисел m и n. Объявить и
    инициализировать массив из k дробей, ввести/вывести значения для массива дробей.
    Создать массив/список/множество объектов и передать его в метод, который изменяет
    каждый элемент массива с четным индексом путем добавления следующего за ним элемента.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
