package com.sinapps.task10;

/*
    Реализовать методы сложения, вычитания, умножения и деления объектов
    (для тех классов, объекты которых могут поддерживать арифметические действия):

    10. Определить класс Прямая на плоскости (пространстве). Определить точки
    пересечения прямой с осями координат. Определить координаты пересечения двух
    прямых. Создать массив/список/множество объектов и определить группы
    параллельных прямых.
 */

public class Main {

    public static void main(String[] args) {
	// write your code here
    }
}
